youngsea2000/STM32MP1xx_Baremetal/example/STM32MP157_A7_DISPLAY/Drivers/BSP/STM32MP1xx_ATK/stm32mp1xx_atk_lcd.c
/**
  ******************************************************************************
  * @file    stm32mp1xx_atk_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on STM32MP135F-DK board.
  @verbatim
  1. How To use this driver:
  --------------------------
     - This driver is used to drive directly an LCD TFT using the LTDC controller.
     - This driver uses timing and setting for EK79001 LCD.

  2. Driver description:
  ---------------------
    + Initialization steps:
       o Initialize the LCD using the BSP_LCD_Init() function.
       o Apply the Layer configuration using the BSP_LCD_LayerDefaultInit() function.
       o Select the LCD layer to be used using the BSP_LCD_SelectLayer() function.
       o Enable the LCD display using the BSP_LCD_DisplayOn() function.

    + Options
       o Configure and enable the color keying functionality using the
         BSP_LCD_SetColorKeying() function.
       o Modify in the fly the transparency and/or the frame buffer address
         using the following functions:
         - BSP_LCD_SetTransparency()
         - BSP_LCD_SetLayerAddress()
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Dependencies
- stm32mp1xx_atk.c
- stm32mp1xx_hal_ltdc.c
- stm32mp1xx_hal_ltdc_ex.c
- stm32mp1xx_hal_rcc_ex.c
- stm32mp1xx_hal_gpio.c
- stm32mp1xx_hal_cortex.c
- ek79001.h
- fonts.h
- font24.c
- font20.c
- font16.c
- font12.c
- font8.c"
EndDependencies */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_atk_lcd.h"


/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP1XX_ATK
  * @{
  */

/** @addtogroup STM32MP1XX_ATK_LCD
  * @{
  */

/** @defgroup STM32MP1XX_ATK_LCD_Private_TypesDefinitions STM32MP1XX_ATK_LCD Private Types Definitions
  * @{
  */
const LCD_UTILS_Drv_t LCD_Driver =
{
  BSP_LCD_DrawBitmap,
  BSP_LCD_FillRGBRect,
  BSP_LCD_DrawHLine,
  BSP_LCD_DrawVLine,
  BSP_LCD_FillRect,
  BSP_LCD_ReadPixel,
  BSP_LCD_WritePixel,
  BSP_LCD_GetXSize,
  BSP_LCD_GetYSize,
  BSP_LCD_SelectLayer,
  BSP_LCD_GetPixelFormat

};
/**
  * @}
  */
/** @defgroup STM32MP1XX_ATK_LCD_Private_Defines STM32MP1XX_ATK LCD Private Defines
  * @{
  */
#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))
#define PIXEL_PER_LINE         (480*2)
#define ALPHA_VALUE             255
/**
  * @}
  */

/** @defgroup STM32MP1XX_ATK_LCD_Private_Macros STM32MP1XX_ATK_LCD Private Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))
/**
  * @}
  */

/** @defgroup STM32MP1XX_ATK_LCD_Private_Variables STM32MP1XX_ATK_LCD Private Variables
  * @{
  */
LTDC_HandleTypeDef  hLtdcHandler;

/* Default LCD configuration with LCD Layer 1 */
static uint32_t            ActiveLayer = 0;
static LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];
/**
  * @}
  */

/** @defgroup STM32MP1XX_ATK_LCD_Private_FunctionPrototypes STM32MP1XX_ATK_LCD Private Function Prototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup STM32MP1XX_ATK_LCD_Exported_Functions STM32MP1XX_ATK_LCD Exported Functions
  * @{
  */

/**
  * @brief  Get the LCD ID.
  * @param  Instance    LCD Instance
  * @retval LCD state
  */
uint8_t BSP_LCD_Get_ID(uint32_t Instance)
{
  uint8_t id = 0;
  GPIO_InitTypeDef gpio_init_structure;

  UNUSED(Instance);

  LCD_ID_M0_GPIO_CLK_ENABLE();
  LCD_ID_M1_GPIO_CLK_ENABLE();
  LCD_ID_M2_GPIO_CLK_ENABLE();

  /* Configure Button pin as input */
  gpio_init_structure.Mode = GPIO_MODE_INPUT;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  
  gpio_init_structure.Pin = LCD_ID_M0_PIN;
  HAL_GPIO_Init(LCD_ID_M0_GPIO_PORT, &gpio_init_structure);
  gpio_init_structure.Pin = LCD_ID_M1_PIN;
  HAL_GPIO_Init(LCD_ID_M1_GPIO_PORT, &gpio_init_structure);
  gpio_init_structure.Pin = LCD_ID_M2_PIN;
  HAL_GPIO_Init(LCD_ID_M2_GPIO_PORT, &gpio_init_structure);

  id |= HAL_GPIO_ReadPin(LCD_ID_M0_GPIO_PORT, LCD_ID_M0_PIN) << 0;
  id |= HAL_GPIO_ReadPin(LCD_ID_M1_GPIO_PORT, LCD_ID_M1_PIN) << 1;
  id |= HAL_GPIO_ReadPin(LCD_ID_M2_GPIO_PORT, LCD_ID_M2_PIN) << 2;
  
  HAL_GPIO_DeInit(LCD_ID_M0_GPIO_PORT, LCD_ID_M0_PIN);
  HAL_GPIO_DeInit(LCD_ID_M1_GPIO_PORT, LCD_ID_M1_PIN);
  HAL_GPIO_DeInit(LCD_ID_M2_GPIO_PORT, LCD_ID_M2_PIN);

  return id;
}

/**
  * @brief  Initializes the LCD.
  * @param  Instance    LCD Instance
  * @retval LCD state
  */
int32_t BSP_LCD_Init(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {

    /* DeInit */
    if (HAL_LTDC_DeInit(&hLtdcHandler) != HAL_OK)
    {
      return LCD_ERROR;
    }

    /* Select the used LCD */

    /* The EK79001 LCD 1024x600 is selected */
    /* Timing Configuration */
    hLtdcHandler.Init.HorizontalSync = (EK79001_HSYNC - (uint16_t)1);
    hLtdcHandler.Init.VerticalSync = (EK79001_VSYNC - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedHBP = (EK79001_HSYNC + EK79001_HBP - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedVBP = (EK79001_VSYNC + EK79001_VBP - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedActiveH = (EK79001_HEIGHT + EK79001_VSYNC + EK79001_VBP - (uint16_t)1);
    hLtdcHandler.Init.AccumulatedActiveW = (EK79001_WIDTH + EK79001_HSYNC + EK79001_HBP - (uint16_t)1);
    hLtdcHandler.Init.TotalHeigh = (EK79001_HEIGHT + EK79001_VSYNC + EK79001_VBP +
                                    EK79001_VFP - (uint16_t)1);
    hLtdcHandler.Init.TotalWidth = (EK79001_WIDTH + EK79001_HSYNC + EK79001_HBP +
                                    EK79001_HFP - (uint16_t)1);

