youngsea2000/STM32MP1xx_Baremetal/example/STM32MP157_A7_DISPLAY/Drivers/BSP/STM32MP1xx_ATK/stm32mp1xx_atk_lcd.c
    switch (PixelFormat)
    {
      case LCD_PIXEL_FORMAT_RGB565:
        *LTDCPixelFormat = LTDC_PIXEL_FORMAT_RGB565;
        break;
      case LCD_PIXEL_FORMAT_ARGB8888:
        *LTDCPixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
        break;
      default:
        *LTDCPixelFormat = LTDC_PIXEL_FORMAT_RGB565;
        break;
    }
  }

  return ret;
}

/**
  * @brief  Gets the LCD Active LCD Pixel Format.
  * @param  Instance    LCD Instance
  * @param  PixelFormat Active LTDC Pixel Format
  * @param  LCDPixelFormat Pointer to Active LCD Pixel Format
  * @retval BSP status
  */
int32_t BSP_LCD_GetLCDPixelFormat(uint32_t Instance, uint32_t PixelFormat, uint32_t *LCDPixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {

    switch (PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_RGB565:
        *LCDPixelFormat = LCD_PIXEL_FORMAT_RGB565;
        break;
      case LTDC_PIXEL_FORMAT_ARGB8888:
        *LCDPixelFormat = LCD_PIXEL_FORMAT_ARGB8888;
        break;
      default:
        *LCDPixelFormat = LCD_PIXEL_FORMAT_RGB565;
        break;
    }
  }

  return ret;
}
/**
  * @brief  Configures the transparency.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background.
  * @param  Transparency: Transparency
  *           This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF
  * @retval None
  */
int32_t BSP_LCD_SetTransparency(uint32_t Instance, uint32_t LayerIndex, uint8_t Transparency)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HAL_LTDC_SetAlpha(&hLtdcHandler, Transparency, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Configures the transparency without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background.
  * @param  Transparency: Transparency
  *           This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF
  * @retval None
  */
int32_t BSP_LCD_SetTransparency_NoReload(uint32_t Instance, uint32_t LayerIndex, uint8_t Transparency)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HAL_LTDC_SetAlpha_NoReload(&hLtdcHandler, Transparency, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Sets an LCD layer frame buffer address.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @param  Address: New LCD frame buffer value
  * @retval None
  */
int32_t BSP_LCD_SetLayerAddress(uint32_t Instance, uint32_t LayerIndex, uint32_t Address)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HAL_LTDC_SetAddress(&hLtdcHandler, Address, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Sets an LCD layer frame buffer address without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @param  Address: New LCD frame buffer value
  * @retval None
  */
int32_t BSP_LCD_SetLayerAddress_NoReload(uint32_t Instance, uint32_t LayerIndex, uint32_t Address)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HAL_LTDC_SetAddress_NoReload(&hLtdcHandler, Address, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;

}

/**
  * @brief  Sets display window.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer index
  * @param  Xpos: LCD X position
  * @param  Ypos: LCD Y position
  * @param  Width: LCD window width
  * @param  Height: LCD window height
  * @retval None
  */
int32_t BSP_LCD_SetLayerWindow(uint32_t Instance, uint16_t LayerIndex, uint16_t Xpos, uint16_t Ypos, uint16_t Width,
                               uint16_t Height)
{
  uint32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Reconfigure the layer size */
    if (HAL_LTDC_SetWindowSize(&hLtdcHandler, Width, Height, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }

    /* Reconfigure the layer position */
    if (HAL_LTDC_SetWindowPosition(&hLtdcHandler, Xpos, Ypos, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Sets display window without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer index
  * @param  Xpos: LCD X position
  * @param  Ypos: LCD Y position
  * @param  Width: LCD window width
  * @param  Height: LCD window height
  * @retval None
  */
int32_t BSP_LCD_SetLayerWindow_NoReload(uint32_t Instance, uint16_t LayerIndex, uint16_t Xpos, uint16_t Ypos,
                                        uint16_t Width, uint16_t Height)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Reconfigure the layer size */
    if (HAL_LTDC_SetWindowSize_NoReload(&hLtdcHandler, Width, Height, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }

    /* Reconfigure the layer position */
    if (HAL_LTDC_SetWindowPosition_NoReload(&hLtdcHandler, Xpos, Ypos, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Configures and sets the color keying.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @param  RGBValue: Color reference
  * @retval None
  */
int32_t BSP_LCD_SetColorKeying(uint32_t Instance, uint32_t LayerIndex, uint32_t RGBValue)
{

  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Configure and Enable the color Keying for LCD Layer */
    if (HAL_LTDC_ConfigColorKeying(&hLtdcHandler, RGBValue, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }

    if (HAL_LTDC_EnableColorKeying(&hLtdcHandler, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Configures and sets the color keying without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @param  RGBValue: Color reference
  * @retval None
  */
int32_t BSP_LCD_SetColorKeying_NoReload(uint32_t Instance, uint32_t LayerIndex, uint32_t RGBValue)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Configure and Enable the color Keying for LCD Layer */
    if (HAL_LTDC_ConfigColorKeying_NoReload(&hLtdcHandler, RGBValue, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }

    if (HAL_LTDC_EnableColorKeying_NoReload(&hLtdcHandler, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Disables the color keying.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @retval None
  */
int32_t BSP_LCD_ResetColorKeying(uint32_t Instance, uint32_t LayerIndex)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Disable the color Keying for LCD Layer */
    if (HAL_LTDC_DisableColorKeying(&hLtdcHandler, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Disables the color keying without reloading.
  * @param  Instance    LCD Instance
  * @param  LayerIndex: Layer foreground or background
  * @retval None
  */
int32_t BSP_LCD_ResetColorKeying_NoReload(uint32_t Instance, uint32_t LayerIndex)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Disable the color Keying for LCD Layer */
    if (HAL_LTDC_DisableColorKeying_NoReload(&hLtdcHandler, LayerIndex) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Disables the color keying without reloading.
  * @param  Instance    LCD Instance
  * @param  ReloadType: can be one of the following values
  *         - LCD_RELOAD_IMMEDIATE
  *         - LCD_RELOAD_VERTICAL_BLANKING
  * @retval None
  */
int32_t BSP_LCD_Reload(uint32_t Instance, uint32_t ReloadType)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HAL_LTDC_Reload(&hLtdcHandler, ReloadType) != HAL_OK)
    {
      return LCD_ERROR;
    }
  }
  return ret;
}

/**
  * @brief  Sets the LCD text color.
  * @param  Instance    LCD Instance
  * @param  Color: Text color code ARGB(8-8-8-8)
  * @retval None
  */
int32_t BSP_LCD_SetTextColor(uint32_t Instance, uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    DrawProp[ActiveLayer].TextColor = Color;
  }
  return ret;
}

/**
  * @brief  Gets the LCD text color.
  * @param  Instance    LCD Instance
  * @retval Used text color.
  */
int32_t BSP_LCD_GetTextColor(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    return DrawProp[ActiveLayer].TextColor;
  }
  return ret;
}

/**
  * @brief  Sets the LCD background color.
  * @param  Instance    LCD Instance
  * @param  Color: Layer background color code ARGB(8-8-8-8)
  * @retval None
  */
int32_t BSP_LCD_SetBackColor(uint32_t Instance, uint32_t Color)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    DrawProp[ActiveLayer].BackColor = Color;
  }
  return ret;
}

/**
  * @brief  Gets the LCD background color.
  * @param  Instance    LCD Instance
  * @retval Used background colour
  */
int32_t BSP_LCD_GetBackColor(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    return DrawProp[ActiveLayer].BackColor;
  }
  return ret;
}


/**
  * @brief  Enables the display.
  * @param  Instance    LCD Instance
  * @retval None
  */
int32_t BSP_LCD_DisplayOn(uint32_t Instance)
{

  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef GPIO_Init_Structure;
  if (Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    // LCD_RST_GPIO_CLK_ENABLE();
    // /* Configure the GPIO RST pin */
    // GPIO_Init_Structure.Pin   = LCD_RST_PIN;
    // GPIO_Init_Structure.Mode  = GPIO_MODE_OUTPUT_PP;
    // GPIO_Init_Structure.Pull  = LCD_RST_PULL;
    // GPIO_Init_Structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    // HAL_GPIO_Init(LCD_RST_GPIO_PORT, &GPIO_Init_Structure);

