youngsea2000/STM32MP1xx_Baremetal/example/STM32MP157_A7_DISPLAY/Drivers/BSP/STM32MP1xx_ATK/stm32mp1xx_atk_lcd.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Params);
  UNUSED(hltdc);

  /* Enable the LTDC clocks */
  __HAL_RCC_LTDC_CLK_ENABLE();

  /* Enable GPIOs clock */
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();
  __HAL_RCC_GPIOK_CLK_ENABLE();

  /*
   * CLK  ----> I14 (AF14)
   * HSYNC----> I12 (AF14)
   * VSYNC----> I13 (AF14)
   * DE   ----> K7  (AF14)
   *
   * R0   ----> I15 (AF14)
   * R1   ----> J0  (AF14)
   * R2   ----> J1  (AF14)
   * R3   ----> J2  (AF14)
   * R4   ----> J3  (AF14)
   * R5   ----> J4  (AF14)
   * R6   ----> J5  (AF14)
   * R7   ----> J6  (AF14)
   *
   * G0   ----> J7  (AF14)
   * G1   ----> J8  (AF14)
   * G2   ----> J9  (AF14)
   * G3   ----> J10 (AF14)
   * G4   ----> J11 (AF14)
   * G5   ----> K0  (AF14)
   * G6   ----> K1  (AF14)
   * G7   ----> K2  (AF14)
   *
   * B0   ----> J12 (AF14)
   * B1   ----> J13 (AF14)
   * B2   ----> J14 (AF14)
   * B3   ----> J15 (AF14)
   * B4   ----> K3  (AF14)
   * B5   ----> K4  (AF14)
   * B6   ----> K5  (AF14)
   * B7   ----> K6  (AF14)
   * */

  /*** LTDC Pins configuration ***/
  /* ('I', 14, AF14) LCD_CLK */
  GPIO_Init_Structure.Pin       = GPIO_PIN_14;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* ('I', 12, AF14) LCD_HSYNC */
  GPIO_Init_Structure.Pin       = GPIO_PIN_12;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* ('I', 13, AF14) LCD_VSYNC */
  GPIO_Init_Structure.Pin       = GPIO_PIN_13;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* ('K',  7, AF14) LCD_DE */
  GPIO_Init_Structure.Pin       = GPIO_PIN_7;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('I', 15, AF14) LCD_R0 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_15;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

  /* ('J',  0, AF14) LCD_R1 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_0;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  1, AF14) LCD_R2 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_1;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  2, AF14) LCD_R3 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_2;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('K',  3, AF14) LCD_R4 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_3;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  4, AF14) LCD_R5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_4;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  5, AF14) LCD_R6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_5;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  6, AF14) LCD_R7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_6;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  7, AF14) LCD_G0 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_7;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  8, AF14) LCD_G1 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_8;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  9, AF14) LCD_G2 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_9;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J', 10, AF14) LCD_G3 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_10;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J', 11, AF14) LCD_G4 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_11;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

