youngsea2000/STM32MP1xx_Baremetal/example/STM32MP157_A7_DISPLAY/Drivers/BSP/STM32MP1xx_ATK/stm32mp1xx_atk_lcd.c
  /* ('K',  0, AF14) LCD_G5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_0;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('K',  1, AF14) LCD_G6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_1;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('K',  2, AF14) LCD_G7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_2;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('J',  12, AF14) LCD_B0 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_12;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  13, AF14) LCD_B1 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_13;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J',  14, AF14) LCD_B2 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_14;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('J', 15, AF14) LCD_B3 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_15;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

  /* ('K',  3, AF14) LCD_B4 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_3;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('K',  4, AF14) LCD_B5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_4;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('K',  5, AF14)  LCD_B6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_5;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* ('K',  6, AF14) LCD_B7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_6;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

  /* GIC configuration for LTDC interrupt */
  IRQ_SetPriority(LTDC_IRQn, 0);
  IRQ_Enable(LTDC_IRQn);

  /* Enable LTDC reset state */
  __HAL_RCC_LTDC_FORCE_RESET();

  /* Release LTDC from reset state */
  __HAL_RCC_LTDC_RELEASE_RESET();

}

/**
  * @brief  DeInitializes BSP_LCD MSP.
  * @param  hltdc: LTDC handle
  * @param  Params
  * @retval None
  */
__weak void BSP_LCD_MspDeInit(LTDC_HandleTypeDef *hltdc, void *Params)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Params);

  /* Disable LTDC block */
  __HAL_LTDC_DISABLE(hltdc);

  /*
   * CLK  ----> I14 (AF14)
   * HSYNC----> I12 (AF14)
   * VSYNC----> I13 (AF14)
   * DE   ----> K7  (AF14)
   *
   * R0   ----> I15 (AF14)
   * R1   ----> J0  (AF14)
   * R2   ----> J1  (AF14)
   * R3   ----> J2  (AF14)
   * R4   ----> J3  (AF14)
   * R5   ----> J4  (AF14)
   * R6   ----> J5  (AF14)
   * R7   ----> J6  (AF14)
   *
   * G0   ----> J7  (AF14)
   * G1   ----> J8  (AF14)
   * G2   ----> J9  (AF14)
   * G3   ----> J10 (AF14)
   * G4   ----> J11 (AF14)
   * G5   ----> K0  (AF14)
   * G6   ----> K1  (AF14)
   * G7   ----> K2  (AF14)
   *
   * B0   ----> J12 (AF14)
   * B1   ----> J13 (AF14)
   * B2   ----> J14 (AF14)
   * B3   ----> J15 (AF14)
   * B4   ----> K3  (AF14)
   * B5   ----> K4  (AF14)
   * B6   ----> K5  (AF14)
   * B7   ----> K6  (AF14)
   * */

  /*** LTDC Pins configuration ***/
  /* ('I', 14, AF14) LCD_CLK */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_14);

  /* ('I', 12, AF14) LCD_HSYNC */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_12);

  /* ('I', 13, AF14) LCD_VSYNC */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_13);

  /* ('K',  7, AF14) LCD_DE */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_7);

  /* ('I', 15, AF14) LCD_R0 */
  HAL_GPIO_DeInit(GPIOI, GPIO_PIN_15);

  /* ('J',  0, AF14) LCD_R1 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_0);

  /* ('J',  1, AF14) LCD_R2 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_1);

  /* ('J',  2, AF14) LCD_R3 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_2);

  /* ('K',  3, AF14) LCD_R4 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_3);

  /* ('J',  4, AF14) LCD_R5 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_4);

  /* ('J',  5, AF14) LCD_R6 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_5);

  /* ('J',  6, AF14) LCD_R7 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_6);

  /* ('J',  7, AF14) LCD_G0 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_7);

  /* ('J',  8, AF14) LCD_G1 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_8);

  /* ('J',  9, AF14) LCD_G2 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_9);

  /* ('J', 10, AF14) LCD_G3 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_10);

  /* ('J', 11, AF14) LCD_G4 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_11);

  /* ('K',  0, AF14) LCD_G5 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_0);

  /* ('K',  1, AF14) LCD_G6 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_1);

  /* ('K',  2, AF14) LCD_G7 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_2);

  /* ('J',  12, AF14) LCD_B0 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_12);

  /* ('J',  13, AF14) LCD_B1 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_13);

  /* ('J',  14, AF14) LCD_B2 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_14);

  /* ('J', 15, AF14) LCD_B3 */
  HAL_GPIO_DeInit(GPIOJ, GPIO_PIN_15);

  /* ('K',  3, AF14) LCD_B4 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_3);

  /* ('K',  4, AF14) LCD_B5 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_4);

  /* ('K',  5, AF14)  LCD_B6 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_5);

  /* ('K',  6, AF14) LCD_B7 */
  HAL_GPIO_DeInit(GPIOK, GPIO_PIN_6);

}

/**
  * @brief  Clock Config.
  * @param  hltdc: LTDC handle
  * @param  Params
  * @note   This API is called by BSP_LCD_Init()
  *         Being __weak it can be overwritten by the application
  * @retval None
  */
__weak void BSP_LCD_ClockConfig(LTDC_HandleTypeDef *hltdc, void *Params)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);
  UNUSED(Params);


}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
